export const vehicles = [
  {
    category: 'Грузовики',
    icon: 'Truck',
    items: [
      { name: 'V-13 Mule', status: 'на ходу', text: 'Основной грузовой тягач Желтого звена.' },
      { name: 'Dustline 4x4', status: 'ремонт', text: 'Быстрый транспорт для коротких выходов.' },
    ],
  },
  {
    category: 'Бронетехника',
    icon: 'Shield',
    items: [
      { name: 'Сварной фургон', status: 'готов', text: 'Бронепластины, решетки, боковой люк.' },
      { name: 'Ridgeback', status: 'ограничен', text: 'Тяжелый расход топлива, но держит обстрел.' },
    ],
  },
  {
    category: 'Инструменты',
    icon: 'Wrench',
    items: [
      { name: 'Полевой комплект М-4', status: 'выдается', text: 'Ремни, провода, герметик, ручной набор.' },
      { name: 'Генераторная станция', status: 'в лагере', text: 'Питает радиоузел и мастерскую.' },
    ],
  },
  {
    category: 'Радиостанции',
    icon: 'Radio',
    items: [
      { name: 'Channel-13', status: 'активно', text: 'Основной внутренний канал Векселя.' },
      { name: 'Шифроблок Salt', status: 'закрыто', text: 'Короткие ключи для ночных выходов.' },
    ],
  },
]
